/*
 * Copyright (c) 2017-2018 THL A29 Limited, a Tencent company. All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
package com.tencentcloudapi.ms.v20180408.models;

import com.tencentcloudapi.common.AbstractModel;
import com.google.gson.annotations.SerializedName;
import com.google.gson.annotations.Expose;
import java.util.HashMap;

public class DescribeUrlDetectionResultResponse extends AbstractModel{

    /**
    * [查询结果]查询结果；枚举值：0 查询成功，否则查询失败
    */
    @SerializedName("ResultCode")
    @Expose
    private Long ResultCode;

    /**
    * [固定信息]响应协议版本号；
    */
    @SerializedName("RespVer")
    @Expose
    private Long RespVer;

    /**
    * [查询结果]url恶意状态；枚举值：1-灰， 2-黑（具体的恶意类型参考恶意类型定义Eviltype字段) ，3-非腾讯白名单，4-腾讯白名单。查询结果（level、evilclass、eviltype）这3个字段在Urltype=2（url状态为黑）下才有意义。
    */
    @SerializedName("UrlType")
    @Expose
    private Long UrlType;

    /**
    * [查询结果]url恶意类型大类:{
    "1": "社工欺诈（仿冒、账号钓鱼、中奖诈骗）",
    "2": "信息诈骗（虚假充值、虚假兼职、虚假金融投资、虚假信用卡代办、网络赌博诈骗）",
    "3": "虚假销售（男女保健美容减肥产品、电子产品、虚假广告、违法销售）",
    "4": "恶意文件（病毒文件，木马文件，恶意apk文件的下载链接以及站点，挂马网站）",
    "5": "博彩网站（博彩网站，在线赌博网站）",
    "6": "色情网站（涉嫌传播色情内容，提供色情服务的网站）",
    "7": "风险网站（弱类型，传播垃圾信息的网站, 如果客户端有阻断，不建议使用这个数据）"
  }
    */
    @SerializedName("EvilClass")
    @Expose
    private Long EvilClass;

    /**
    * [查询结果]url恶意类型:{
    "2": "盗号网站",
    "4": "中奖诈骗",
    "5": "虚假游戏币充值",
    "6": "非法政治",
    "7": "欺诈网站",
    "8": "刷Q币Q钻",
    "9": "欺诈类网站（总,不拦截）",
    "10": "欺诈-卡盟",
    "13": "非法商品",
    "14": "欺诈电话",
    "15": "贩卖枪支",
    "16": "话费欺诈",
    "17": "裸聊（拦截）",
    "18": "仿冒网站-银联举报",
    "19": "聊天室（不拦截）",
    "20": "成人游戏（不拦截）",
    "21": "一夜情交友(不拦截)",
    "22": "色情服务（不拦截）",
    "23": "微博拉黑",
    "24": "下载风险",
    "25": "病毒软件(apk)",
    "26": "病毒软件(apk不拦截)",
    "27": "病毒软件(apk低风险不拦截)",
    "28": "漏洞网站",
    "29": "色情网站-扫黄打非",
    "30": "可疑盗号（不拦截）",
    "31": "仿冒京东",
    "32": "仿冒银行",
    "33": "仿冒运营商",
    "34": "扫黄打非",
    "35": "仿冒苹果",
    "36": "CNCERT-木马",
    "37": "CNCERT-移动病毒",
    "38": "CNCERT-钓鱼",
    "39": "在线赌博",
    "40": "赌博游戏",
    "41": "秒赞",
    "42": "虚假商品",
    "43": "仿冒腾讯网",
    "44": "游戏账号交易",
    "45": "二手交易诈骗",
    "46": "充值平台-卡盟",
    "47": "虚假兼职",
    "48": "公司业务充值",
    "49": "赌博投注",
    "50": "侵权网站",
    "51": "兼职招聘后台",
    "52": "虚假支付",
    "53": "虚假兼职",
    "54": "虚假视频",
    "55": "虚假小说",
    "56": "非法图片",
    "57": "成人用品",
    "58": "虚假兼职bbs",
    "59": "虚假兼职流程",
    "60": "仿冒政府",
    "62": "虚假广告",
    "63": "恶意跳转",
    "64": "盗版腾讯视频",
    "65": "NBA直播盗版",
    "66": "测试",
    "68": "空间欺诈",
    "70": "清粉",
    "76": "含有apk的恶意url",
    "77": "拦截马",
    "78": "黑产",
    "79": "虚假投资理财",
    "80": "侵权网站",
    "81": "仿冒公检法",
    "82": "诱导传播-U镜",
    "83": "仿冒微信",
    "84": "买卖微信账号",
    "88": "欺诈网站(品牌保护专用)",
    "91": "非法政治(领导人)",
    "92": "非法政治（六四）",
    "93": "非法政治（法轮功）",
    "94": "非法政治（攻击政党）",
    "95": "非法政治（暴恐）",
    "96": "非法政治（其他）",
    "100": "信安博彩",
    "101": "信安色情",
    "102": "信安事件",
    "103": "信安暴力",
    "104": "信安违法",
    "105": "信安欺诈",
    "106": "信安版权",
    "107": "信安谣言",
    "108": "信安欺诈总",
    "109": "游戏租号",
    "110": "恶意挖矿",
    "120": "虚假广告推广",
    "128": "欺诈网站（网信办）",
    "222": "高考诈骗",
    "248": "非法色情",
    "250": "游戏盗号",
    "251": "游戏推广",
    "252": "股票推荐",
    "253": "工作流程",
    "254": "兼职申请表",
    "255": "tag检测色情",
    "256": "非法色情（cache已淘汰）",
    "257": "非法色情-搜索",
    "258": "非法色情（强类型）",
    "259": "非法色情（支付）",
    "260": "非法色情（支付）",
    "261": "诱导支付（红包）",
    "262": "儿童色情网站",
    "263": "加群支付",
    "264": "支付后台",
    "265": "本命佛",
    "266": "二维码软文",
    "267": "机器学习虚假博彩",
    "268": "色情网站(网信办)",
    "269": "机器学习虚假色情",
    "270": "虚假支付",
    "271": "佛法",
    "272": "仿冒公检法_监控",
    "273": "仿冒公检法_回溯",
    "277": "色情诈骗",
    "279": "色情推广",
    "280": "私家侦探",
    "281": "低俗小说",
    "299": "欺诈投资理财",
    "300": "政府同步P2P平台",
    "302": "违规口罩销售",
    "303": "个人销售电子烟",
    "512": "挂马网站",
    "598": "漏洞网站",
    "600": "翻墙软件",
    "900": "侵权网站",
    "1111": "危险网址",
    "1112": "危险网址",
    "1113": "危险网址",
    "1114": "危险网址",
    "1115": "危险网址",
    "1540": "测试使用",
    "2048": "欺诈广告",
    "2100": "GPS欺诈",
    "2257": "虚假信息",
    "2258": "虚假信息",
    "2300": "虚假信息",
    "2302": "异常传播",
    "2303": "去结构化(聚类)",
    "2304": "去结构化",
    "2305": "骚扰传播",
    "2306": "mqq跳转传播",
    "2307": "低俗推广",
    "2308": "虚假信息",
    "2310": "微信诱导分享",
    "2400": "虚假信息",
    "2401": "虚假信息",
    "2402": "虚假信息",
    "2501": "色情支付APK",
    "2502": "仿冒公检法APK",
    "2503": "诱导分享APK",
    "2504": "赌博APK",
    "2505": "外挂APK",
    "2506": "贷款欺诈APP",
    "2507": "刷单欺诈APP",
    "2508": "理财欺诈APP",
    "2509": "赌博APK",
    "2510": "杀猪盘APP下载",
    "2511": "刷单APP下载",
    "2513": "贷款app下载",
    "2600": "仿冒品牌保护网站",
    "2700": "站点QQ发送异常",
    "2701": "王者充值",
    "2702": "王者礼包",
    "2703": "虚假信息",
    "2704": "虚假信息",
    "2705": "虚假信息",
    "2706": "虚假信息",
    "2707": "仿冒壳牌",
    "2708": "善心汇",
    "2709": "虚假信息",
    "2710": "空间诱导",
    "2711": "漏洞利用",
    "2712": "扫码诱导",
    "2713": "虚假信息",
    "2800": "异常传播",
    "2801": "QQ去rich",
    "2802": "未知去rich",
    "2803": "QQ丢弃",
    "2804": "账号提醒",
    "2805": "可疑分享中间页",
    "2806": "继续访问中间页",
    "2808": "账号提醒",
    "2809": "微信提醒",
    "2810": "非QQ官方网站",
    "2901": "医疗器械标识",
    "2902": "西安工商风险网站",
    "2903": "西安食药提醒备案",
    "2904": "西安食药提示风险",
    "3001": "发言侵权",
    "8192": "虚假商品",
    "8193": "二手车",
    "8194": "虚假手表",
    "8195": "虚假商品-壮阳",
    "8196": "虚假商品-稽查局",
    "8197": "虚假数码",
    "8198": "虚假贷款",
    "8199": "假信用卡",
    "8200": "假银行卡",
    "8201": "虚假股票证券交易",
    "8202": "特供商品",
    "8203": "非法虚拟币交易",
    "8204": "可疑虚拟币交易",
    "8205": "虚假商品交易平台",
    "8206": "可疑商品交易平台",
    "8207": "股票投资直播",
    "8208": "一元夺宝云购",
    "8209": "传销（新）",
    "8210": "可疑贷款",
    "8211": "可疑信用卡",
    "8212": "可疑投资理财",
    "8213": "虚假治疗药品",
    "8214": "虚假美容药品",
    "8215": "A货网址",
    "8216": "零元拍",
    "8220": "可疑返利信息",
    "8250": "虚假外汇交易",
    "8251": "可疑外汇交易",
    "8252": "虚假贵金属交易",
    "8253": "可疑贵金属交易",
    "8254": "虚假大宗商品交易",
    "8255": "可疑大宗商品交易",
    "8256": "虚假期货交易",
    "8257": "可疑期货交易",
    "8258": "外汇交易拦截",
    "8259": "淘宝诱导",
    "8260": "高风险小额贷款",
    "8261": "低风险小额贷款",
    "8262": "小额贷款信息发布平台",
    "8263": "基金投资平台",
    "8264": "股票咨询平台",
    "8265": "邮币卡交易",
    "8266": "高风险文化产权交易所",
    "8267": "低风险文化产权交易所",
    "8268": "杀毒软件威胁下载",
    "8269": "股票配资",
    "8270": "外汇信息交流",
    "8271": "杀毒软件威胁下载(调起震动)",
    "8272": "贷款口子",
    "8273": "赌博棋牌",
    "8274": "案情贷款诈骗",
    "8275": "案情刷单诈骗",
    "8276": "案情贷款诈骗",
    "8277": "可疑的客服链接",
    "8278": "仿冒的购物网站",
    "8300": "成人用品",
    "8301": "融资租赁",
    "8302": "供应链金融",
    "8303": "保理",
    "8304": "投资管理",
    "8305": "金融服务",
    "8306": "交易类返佣跟单平台",
    "8307": "交易类直播喊单平台",
    "8308": "金融配资",
    "8309": "期货平台",
    "8310": "其他投资",
    "8311": "可疑区块链",
    "8312": "加微信虚假广告",
    "8313": "仿冒微粒贷",
    "8314": "Safari崩溃",
    "8315": "色情诱导支付",
    "8316": "仿冒拼多多网站",
    "8317": "电影众筹",
    "8318": "理财通数字竞猜",
    "8319": "卡盟平台",
    "8320": "发卡平台",
    "8321": "(扫码渠道)仿冒欺诈网站",
    "8322": "ETC速通卡仿冒",
    "8323": "工商登记诈骗",
    "8324": "违规，欺诈网站",
    "16383": "非法博彩",
    "16384": "非法博彩",
    "16386": "博彩支付",
    "16387": "虚假彩票",
    "16388": "腾讯分分彩",
    "16389": "非法博彩(网信办)",
    "16390": "虚假彩票-有备案",
    "16391": "非法博彩-有备案",
    "16392": "彩票预测-有备案",
    "16393": "博彩诈骗",
    "16394": "高危博彩",
    "16395": "虚假链接",
    "16396": "博彩诈骗",
    "16397": "电竞赌博",
    "16398": "博彩诈骗",
    "16399": "非法博彩(网信办)",
    "16407": "非法欺诈（用户举报）",
    "16489": "非法博彩（用户举报）",
    "16501": "贷款诈骗APP中的链接",
    "16502": "理财诈骗app内部链接",
    "16503": "赌博app中的内部链接",
    "16505": "杀猪盘诈骗",
    "16506": "贷款诈骗",
    "16507": "刷单诈骗",
    "16508": "非法博彩",
    "16509": "涉政信息",
    "16510": "枪支信息",
    "16511": "黄毒网址",
    "16521": "投资诈骗",
    "16522": "",
    "16523": "",
    "16524": "赌博网站",
    "16525": "",
    "16526": "",
    "16527": "黄毒网站",
    "16555": "可疑信息",
    "20001": "法律追损",
    "20040": "赌博订单平台",
    "32768": "虚假火车票",
    "65536": "虚假视频",
    "65537": "虚假视频-沙箱",
    "65538": "诱导下载-管家",
    "100000": "公司代注册",
    "100001": "手机维修",
    "262144": "彩票预测信息",
    "524288": "病毒软件",
    "524289": "病毒软件-色播",
    "1001000": "欺诈大类-其他",
    "1048577": "非法外挂",
    "1048578": "木马外挂",
    "1048579": "非法私服",
    "1048580": "游戏代练",
    "2097152": "仿冒淘宝",
    "4194304": "仿冒腾讯游戏",
    "5001000": "赌博-其他",
    "5001101": "赌博-其他（浏览器）",
    "6001000": "色情-其他",
    "8388608": "虚假机票",
    "16777216": "金融传销",
    "16777300": "微交易微盘",
    "33554432": "仿冒网站",
    "33554433": "假发票验证平台",
    "67108864": "虚假药品",
    "67108866": "虚假商品",
    "268435456": "淘宝刷钻"
  }
    */
    @SerializedName("EvilType")
    @Expose
    private Long EvilType;

    /**
    * [查询结果]url恶意级别:{
    "1": "链接",
    "2": "Cgi",
    "3": "路径",
    "4": "整站",
    "5": "整域"
}
    */
    @SerializedName("Level")
    @Expose
    private Long Level;

    /**
    * [查询详情]url检出时间
    */
    @SerializedName("DetectTime")
    @Expose
    private Long DetectTime;

    /**
    * [查询详情]拦截Wording
    */
    @SerializedName("Wording")
    @Expose
    private String Wording;

    /**
    * [查询详情]拦截Wording 标题
    */
    @SerializedName("WordingTitle")
    @Expose
    private String WordingTitle;

    /**
    * [查询结果]url恶意状态说明；为UrlType字段值对应的说明
    */
    @SerializedName("UrlTypeDesc")
    @Expose
    private String UrlTypeDesc;

    /**
    * [查询结果]url恶意大类说明；为EvilClass字段值对应的说明
    */
    @SerializedName("EvilClassDesc")
    @Expose
    private String EvilClassDesc;

    /**
    * [查询结果]url恶意类型说明；为EvilType字段值对应的说明
    */
    @SerializedName("EvilTypeDesc")
    @Expose
    private String EvilTypeDesc;

    /**
    * [查询结果]url恶意级别说明；为Level字段值对应的说明
    */
    @SerializedName("LevelDesc")
    @Expose
    private String LevelDesc;

    /**
    * 唯一请求 ID，每次请求都会返回。定位问题时需要提供该次请求的 RequestId。
    */
    @SerializedName("RequestId")
    @Expose
    private String RequestId;

    /**
     * Get [查询结果]查询结果；枚举值：0 查询成功，否则查询失败 
     * @return ResultCode [查询结果]查询结果；枚举值：0 查询成功，否则查询失败
     */
    public Long getResultCode() {
        return this.ResultCode;
    }

    /**
     * Set [查询结果]查询结果；枚举值：0 查询成功，否则查询失败
     * @param ResultCode [查询结果]查询结果；枚举值：0 查询成功，否则查询失败
     */
    public void setResultCode(Long ResultCode) {
        this.ResultCode = ResultCode;
    }

    /**
     * Get [固定信息]响应协议版本号； 
     * @return RespVer [固定信息]响应协议版本号；
     */
    public Long getRespVer() {
        return this.RespVer;
    }

    /**
     * Set [固定信息]响应协议版本号；
     * @param RespVer [固定信息]响应协议版本号；
     */
    public void setRespVer(Long RespVer) {
        this.RespVer = RespVer;
    }

    /**
     * Get [查询结果]url恶意状态；枚举值：1-灰， 2-黑（具体的恶意类型参考恶意类型定义Eviltype字段) ，3-非腾讯白名单，4-腾讯白名单。查询结果（level、evilclass、eviltype）这3个字段在Urltype=2（url状态为黑）下才有意义。 
     * @return UrlType [查询结果]url恶意状态；枚举值：1-灰， 2-黑（具体的恶意类型参考恶意类型定义Eviltype字段) ，3-非腾讯白名单，4-腾讯白名单。查询结果（level、evilclass、eviltype）这3个字段在Urltype=2（url状态为黑）下才有意义。
     */
    public Long getUrlType() {
        return this.UrlType;
    }

    /**
     * Set [查询结果]url恶意状态；枚举值：1-灰， 2-黑（具体的恶意类型参考恶意类型定义Eviltype字段) ，3-非腾讯白名单，4-腾讯白名单。查询结果（level、evilclass、eviltype）这3个字段在Urltype=2（url状态为黑）下才有意义。
     * @param UrlType [查询结果]url恶意状态；枚举值：1-灰， 2-黑（具体的恶意类型参考恶意类型定义Eviltype字段) ，3-非腾讯白名单，4-腾讯白名单。查询结果（level、evilclass、eviltype）这3个字段在Urltype=2（url状态为黑）下才有意义。
     */
    public void setUrlType(Long UrlType) {
        this.UrlType = UrlType;
    }

    /**
     * Get [查询结果]url恶意类型大类:{
    "1": "社工欺诈（仿冒、账号钓鱼、中奖诈骗）",
    "2": "信息诈骗（虚假充值、虚假兼职、虚假金融投资、虚假信用卡代办、网络赌博诈骗）",
    "3": "虚假销售（男女保健美容减肥产品、电子产品、虚假广告、违法销售）",
    "4": "恶意文件（病毒文件，木马文件，恶意apk文件的下载链接以及站点，挂马网站）",
    "5": "博彩网站（博彩网站，在线赌博网站）",
    "6": "色情网站（涉嫌传播色情内容，提供色情服务的网站）",
    "7": "风险网站（弱类型，传播垃圾信息的网站, 如果客户端有阻断，不建议使用这个数据）"
  } 
     * @return EvilClass [查询结果]url恶意类型大类:{
    "1": "社工欺诈（仿冒、账号钓鱼、中奖诈骗）",
    "2": "信息诈骗（虚假充值、虚假兼职、虚假金融投资、虚假信用卡代办、网络赌博诈骗）",
    "3": "虚假销售（男女保健美容减肥产品、电子产品、虚假广告、违法销售）",
    "4": "恶意文件（病毒文件，木马文件，恶意apk文件的下载链接以及站点，挂马网站）",
    "5": "博彩网站（博彩网站，在线赌博网站）",
    "6": "色情网站（涉嫌传播色情内容，提供色情服务的网站）",
    "7": "风险网站（弱类型，传播垃圾信息的网站, 如果客户端有阻断，不建议使用这个数据）"
  }
     */
    public Long getEvilClass() {
        return this.EvilClass;
    }

    /**
     * Set [查询结果]url恶意类型大类:{
    "1": "社工欺诈（仿冒、账号钓鱼、中奖诈骗）",
    "2": "信息诈骗（虚假充值、虚假兼职、虚假金融投资、虚假信用卡代办、网络赌博诈骗）",
    "3": "虚假销售（男女保健美容减肥产品、电子产品、虚假广告、违法销售）",
    "4": "恶意文件（病毒文件，木马文件，恶意apk文件的下载链接以及站点，挂马网站）",
    "5": "博彩网站（博彩网站，在线赌博网站）",
    "6": "色情网站（涉嫌传播色情内容，提供色情服务的网站）",
    "7": "风险网站（弱类型，传播垃圾信息的网站, 如果客户端有阻断，不建议使用这个数据）"
  }
     * @param EvilClass [查询结果]url恶意类型大类:{
    "1": "社工欺诈（仿冒、账号钓鱼、中奖诈骗）",
    "2": "信息诈骗（虚假充值、虚假兼职、虚假金融投资、虚假信用卡代办、网络赌博诈骗）",
    "3": "虚假销售（男女保健美容减肥产品、电子产品、虚假广告、违法销售）",
    "4": "恶意文件（病毒文件，木马文件，恶意apk文件的下载链接以及站点，挂马网站）",
    "5": "博彩网站（博彩网站，在线赌博网站）",
    "6": "色情网站（涉嫌传播色情内容，提供色情服务的网站）",
    "7": "风险网站（弱类型，传播垃圾信息的网站, 如果客户端有阻断，不建议使用这个数据）"
  }
     */
    public void setEvilClass(Long EvilClass) {
        this.EvilClass = EvilClass;
    }

    /**
     * Get [查询结果]url恶意类型:{
    "2": "盗号网站",
    "4": "中奖诈骗",
    "5": "虚假游戏币充值",
    "6": "非法政治",
    "7": "欺诈网站",
    "8": "刷Q币Q钻",
    "9": "欺诈类网站（总,不拦截）",
    "10": "欺诈-卡盟",
    "13": "非法商品",
    "14": "欺诈电话",
    "15": "贩卖枪支",
    "16": "话费欺诈",
    "17": "裸聊（拦截）",
    "18": "仿冒网站-银联举报",
    "19": "聊天室（不拦截）",
    "20": "成人游戏（不拦截）",
    "21": "一夜情交友(不拦截)",
    "22": "色情服务（不拦截）",
    "23": "微博拉黑",
    "24": "下载风险",
    "25": "病毒软件(apk)",
    "26": "病毒软件(apk不拦截)",
    "27": "病毒软件(apk低风险不拦截)",
    "28": "漏洞网站",
    "29": "色情网站-扫黄打非",
    "30": "可疑盗号（不拦截）",
    "31": "仿冒京东",
    "32": "仿冒银行",
    "33": "仿冒运营商",
    "34": "扫黄打非",
    "35": "仿冒苹果",
    "36": "CNCERT-木马",
    "37": "CNCERT-移动病毒",
    "38": "CNCERT-钓鱼",
    "39": "在线赌博",
    "40": "赌博游戏",
    "41": "秒赞",
    "42": "虚假商品",
    "43": "仿冒腾讯网",
    "44": "游戏账号交易",
    "45": "二手交易诈骗",
    "46": "充值平台-卡盟",
    "47": "虚假兼职",
    "48": "公司业务充值",
    "49": "赌博投注",
    "50": "侵权网站",
    "51": "兼职招聘后台",
    "52": "虚假支付",
    "53": "虚假兼职",
    "54": "虚假视频",
    "55": "虚假小说",
    "56": "非法图片",
    "57": "成人用品",
    "58": "虚假兼职bbs",
    "59": "虚假兼职流程",
    "60": "仿冒政府",
    "62": "虚假广告",
    "63": "恶意跳转",
    "64": "盗版腾讯视频",
    "65": "NBA直播盗版",
    "66": "测试",
    "68": "空间欺诈",
    "70": "清粉",
    "76": "含有apk的恶意url",
    "77": "拦截马",
    "78": "黑产",
    "79": "虚假投资理财",
    "80": "侵权网站",
    "81": "仿冒公检法",
    "82": "诱导传播-U镜",
    "83": "仿冒微信",
    "84": "买卖微信账号",
    "88": "欺诈网站(品牌保护专用)",
    "91": "非法政治(领导人)",
    "92": "非法政治（六四）",
    "93": "非法政治（法轮功）",
    "94": "非法政治（攻击政党）",
    "95": "非法政治（暴恐）",
    "96": "非法政治（其他）",
    "100": "信安博彩",
    "101": "信安色情",
    "102": "信安事件",
    "103": "信安暴力",
    "104": "信安违法",
    "105": "信安欺诈",
    "106": "信安版权",
    "107": "信安谣言",
    "108": "信安欺诈总",
    "109": "游戏租号",
    "110": "恶意挖矿",
    "120": "虚假广告推广",
    "128": "欺诈网站（网信办）",
    "222": "高考诈骗",
    "248": "非法色情",
    "250": "游戏盗号",
    "251": "游戏推广",
    "252": "股票推荐",
    "253": "工作流程",
    "254": "兼职申请表",
    "255": "tag检测色情",
    "256": "非法色情（cache已淘汰）",
    "257": "非法色情-搜索",
    "258": "非法色情（强类型）",
    "259": "非法色情（支付）",
    "260": "非法色情（支付）",
    "261": "诱导支付（红包）",
    "262": "儿童色情网站",
    "263": "加群支付",
    "264": "支付后台",
    "265": "本命佛",
    "266": "二维码软文",
    "267": "机器学习虚假博彩",
    "268": "色情网站(网信办)",
    "269": "机器学习虚假色情",
    "270": "虚假支付",
    "271": "佛法",
    "272": "仿冒公检法_监控",
    "273": "仿冒公检法_回溯",
    "277": "色情诈骗",
    "279": "色情推广",
    "280": "私家侦探",
    "281": "低俗小说",
    "299": "欺诈投资理财",
    "300": "政府同步P2P平台",
    "302": "违规口罩销售",
    "303": "个人销售电子烟",
    "512": "挂马网站",
    "598": "漏洞网站",
    "600": "翻墙软件",
    "900": "侵权网站",
    "1111": "危险网址",
    "1112": "危险网址",
    "1113": "危险网址",
    "1114": "危险网址",
    "1115": "危险网址",
    "1540": "测试使用",
    "2048": "欺诈广告",
    "2100": "GPS欺诈",
    "2257": "虚假信息",
    "2258": "虚假信息",
    "2300": "虚假信息",
    "2302": "异常传播",
    "2303": "去结构化(聚类)",
    "2304": "去结构化",
    "2305": "骚扰传播",
    "2306": "mqq跳转传播",
    "2307": "低俗推广",
    "2308": "虚假信息",
    "2310": "微信诱导分享",
    "2400": "虚假信息",
    "2401": "虚假信息",
    "2402": "虚假信息",
    "2501": "色情支付APK",
    "2502": "仿冒公检法APK",
    "2503": "诱导分享APK",
    "2504": "赌博APK",
    "2505": "外挂APK",
    "2506": "贷款欺诈APP",
    "2507": "刷单欺诈APP",
    "2508": "理财欺诈APP",
    "2509": "赌博APK",
    "2510": "杀猪盘APP下载",
    "2511": "刷单APP下载",
    "2513": "贷款app下载",
    "2600": "仿冒品牌保护网站",
    "2700": "站点QQ发送异常",
    "2701": "王者充值",
    "2702": "王者礼包",
    "2703": "虚假信息",
    "2704": "虚假信息",
    "2705": "虚假信息",
    "2706": "虚假信息",
    "2707": "仿冒壳牌",
    "2708": "善心汇",
    "2709": "虚假信息",
    "2710": "空间诱导",
    "2711": "漏洞利用",
    "2712": "扫码诱导",
    "2713": "虚假信息",
    "2800": "异常传播",
    "2801": "QQ去rich",
    "2802": "未知去rich",
    "2803": "QQ丢弃",
    "2804": "账号提醒",
    "2805": "可疑分享中间页",
    "2806": "继续访问中间页",
    "2808": "账号提醒",
    "2809": "微信提醒",
    "2810": "非QQ官方网站",
    "2901": "医疗器械标识",
    "2902": "西安工商风险网站",
    "2903": "西安食药提醒备案",
    "2904": "西安食药提示风险",
    "3001": "发言侵权",
    "8192": "虚假商品",
    "8193": "二手车",
    "8194": "虚假手表",
    "8195": "虚假商品-壮阳",
    "8196": "虚假商品-稽查局",
    "8197": "虚假数码",
    "8198": "虚假贷款",
    "8199": "假信用卡",
    "8200": "假银行卡",
    "8201": "虚假股票证券交易",
    "8202": "特供商品",
    "8203": "非法虚拟币交易",
    "8204": "可疑虚拟币交易",
    "8205": "虚假商品交易平台",
    "8206": "可疑商品交易平台",
    "8207": "股票投资直播",
    "8208": "一元夺宝云购",
    "8209": "传销（新）",
    "8210": "可疑贷款",
    "8211": "可疑信用卡",
    "8212": "可疑投资理财",
    "8213": "虚假治疗药品",
    "8214": "虚假美容药品",
    "8215": "A货网址",
    "8216": "零元拍",
    "8220": "可疑返利信息",
    "8250": "虚假外汇交易",
    "8251": "可疑外汇交易",
    "8252": "虚假贵金属交易",
    "8253": "可疑贵金属交易",
    "8254": "虚假大宗商品交易",
    "8255": "可疑大宗商品交易",
    "8256": "虚假期货交易",
    "8257": "可疑期货交易",
    "8258": "外汇交易拦截",
    "8259": "淘宝诱导",
    "8260": "高风险小额贷款",
    "8261": "低风险小额贷款",
    "8262": "小额贷款信息发布平台",
    "8263": "基金投资平台",
    "8264": "股票咨询平台",
    "8265": "邮币卡交易",
    "8266": "高风险文化产权交易所",
    "8267": "低风险文化产权交易所",
    "8268": "杀毒软件威胁下载",
    "8269": "股票配资",
    "8270": "外汇信息交流",
    "8271": "杀毒软件威胁下载(调起震动)",
    "8272": "贷款口子",
    "8273": "赌博棋牌",
    "8274": "案情贷款诈骗",
    "8275": "案情刷单诈骗",
    "8276": "案情贷款诈骗",
    "8277": "可疑的客服链接",
    "8278": "仿冒的购物网站",
    "8300": "成人用品",
    "8301": "融资租赁",
    "8302": "供应链金融",
    "8303": "保理",
    "8304": "投资管理",
    "8305": "金融服务",
    "8306": "交易类返佣跟单平台",
    "8307": "交易类直播喊单平台",
    "8308": "金融配资",
    "8309": "期货平台",
    "8310": "其他投资",
    "8311": "可疑区块链",
    "8312": "加微信虚假广告",
    "8313": "仿冒微粒贷",
    "8314": "Safari崩溃",
    "8315": "色情诱导支付",
    "8316": "仿冒拼多多网站",
    "8317": "电影众筹",
    "8318": "理财通数字竞猜",
    "8319": "卡盟平台",
    "8320": "发卡平台",
    "8321": "(扫码渠道)仿冒欺诈网站",
    "8322": "ETC速通卡仿冒",
    "8323": "工商登记诈骗",
    "8324": "违规，欺诈网站",
    "16383": "非法博彩",
    "16384": "非法博彩",
    "16386": "博彩支付",
    "16387": "虚假彩票",
    "16388": "腾讯分分彩",
    "16389": "非法博彩(网信办)",
    "16390": "虚假彩票-有备案",
    "16391": "非法博彩-有备案",
    "16392": "彩票预测-有备案",
    "16393": "博彩诈骗",
    "16394": "高危博彩",
    "16395": "虚假链接",
    "16396": "博彩诈骗",
    "16397": "电竞赌博",
    "16398": "博彩诈骗",
    "16399": "非法博彩(网信办)",
    "16407": "非法欺诈（用户举报）",
    "16489": "非法博彩（用户举报）",
    "16501": "贷款诈骗APP中的链接",
    "16502": "理财诈骗app内部链接",
    "16503": "赌博app中的内部链接",
    "16505": "杀猪盘诈骗",
    "16506": "贷款诈骗",
    "16507": "刷单诈骗",
    "16508": "非法博彩",
    "16509": "涉政信息",
    "16510": "枪支信息",
    "16511": "黄毒网址",
    "16521": "投资诈骗",
    "16522": "",
    "16523": "",
    "16524": "赌博网站",
    "16525": "",
    "16526": "",
    "16527": "黄毒网站",
    "16555": "可疑信息",
    "20001": "法律追损",
    "20040": "赌博订单平台",
    "32768": "虚假火车票",
    "65536": "虚假视频",
    "65537": "虚假视频-沙箱",
    "65538": "诱导下载-管家",
    "100000": "公司代注册",
    "100001": "手机维修",
    "262144": "彩票预测信息",
    "524288": "病毒软件",
    "524289": "病毒软件-色播",
    "1001000": "欺诈大类-其他",
    "1048577": "非法外挂",
    "1048578": "木马外挂",
    "1048579": "非法私服",
    "1048580": "游戏代练",
    "2097152": "仿冒淘宝",
    "4194304": "仿冒腾讯游戏",
    "5001000": "赌博-其他",
    "5001101": "赌博-其他（浏览器）",
    "6001000": "色情-其他",
    "8388608": "虚假机票",
    "16777216": "金融传销",
    "16777300": "微交易微盘",
    "33554432": "仿冒网站",
    "33554433": "假发票验证平台",
    "67108864": "虚假药品",
    "67108866": "虚假商品",
    "268435456": "淘宝刷钻"
  } 
     * @return EvilType [查询结果]url恶意类型:{
    "2": "盗号网站",
    "4": "中奖诈骗",
    "5": "虚假游戏币充值",
    "6": "非法政治",
    "7": "欺诈网站",
    "8": "刷Q币Q钻",
    "9": "欺诈类网站（总,不拦截）",
    "10": "欺诈-卡盟",
    "13": "非法商品",
    "14": "欺诈电话",
    "15": "贩卖枪支",
    "16": "话费欺诈",
    "17": "裸聊（拦截）",
    "18": "仿冒网站-银联举报",
    "19": "聊天室（不拦截）",
    "20": "成人游戏（不拦截）",
    "21": "一夜情交友(不拦截)",
    "22": "色情服务（不拦截）",
    "23": "微博拉黑",
    "24": "下载风险",
    "25": "病毒软件(apk)",
    "26": "病毒软件(apk不拦截)",
    "27": "病毒软件(apk低风险不拦截)",
    "28": "漏洞网站",
    "29": "色情网站-扫黄打非",
    "30": "可疑盗号（不拦截）",
    "31": "仿冒京东",
    "32": "仿冒银行",
    "33": "仿冒运营商",
    "34": "扫黄打非",
    "35": "仿冒苹果",
    "36": "CNCERT-木马",
    "37": "CNCERT-移动病毒",
    "38": "CNCERT-钓鱼",
    "39": "在线赌博",
    "40": "赌博游戏",
    "41": "秒赞",
    "42": "虚假商品",
    "43": "仿冒腾讯网",
    "44": "游戏账号交易",
    "45": "二手交易诈骗",
    "46": "充值平台-卡盟",
    "47": "虚假兼职",
    "48": "公司业务充值",
    "49": "赌博投注",
    "50": "侵权网站",
    "51": "兼职招聘后台",
    "52": "虚假支付",
    "53": "虚假兼职",
    "54": "虚假视频",
    "55": "虚假小说",
    "56": "非法图片",
    "57": "成人用品",
    "58": "虚假兼职bbs",
    "59": "虚假兼职流程",
    "60": "仿冒政府",
    "62": "虚假广告",
    "63": "恶意跳转",
    "64": "盗版腾讯视频",
    "65": "NBA直播盗版",
    "66": "测试",
    "68": "空间欺诈",
    "70": "清粉",
    "76": "含有apk的恶意url",
    "77": "拦截马",
    "78": "黑产",
    "79": "虚假投资理财",
    "80": "侵权网站",
    "81": "仿冒公检法",
    "82": "诱导传播-U镜",
    "83": "仿冒微信",
    "84": "买卖微信账号",
    "88": "欺诈网站(品牌保护专用)",
    "91": "非法政治(领导人)",
    "92": "非法政治（六四）",
    "93": "非法政治（法轮功）",
    "94": "非法政治（攻击政党）",
    "95": "非法政治（暴恐）",
    "96": "非法政治（其他）",
    "100": "信安博彩",
    "101": "信安色情",
    "102": "信安事件",
    "103": "信安暴力",
    "104": "信安违法",
    "105": "信安欺诈",
    "106": "信安版权",
    "107": "信安谣言",
    "108": "信安欺诈总",
    "109": "游戏租号",
    "110": "恶意挖矿",
    "120": "虚假广告推广",
    "128": "欺诈网站（网信办）",
    "222": "高考诈骗",
    "248": "非法色情",
    "250": "游戏盗号",
    "251": "游戏推广",
    "252": "股票推荐",
    "253": "工作流程",
    "254": "兼职申请表",
    "255": "tag检测色情",
    "256": "非法色情（cache已淘汰）",
    "257": "非法色情-搜索",
    "258": "非法色情（强类型）",
    "259": "非法色情（支付）",
    "260": "非法色情（支付）",
    "261": "诱导支付（红包）",
    "262": "儿童色情网站",
    "263": "加群支付",
    "264": "支付后台",
    "265": "本命佛",
    "266": "二维码软文",
    "267": "机器学习虚假博彩",
    "268": "色情网站(网信办)",
    "269": "机器学习虚假色情",
    "270": "虚假支付",
    "271": "佛法",
    "272": "仿冒公检法_监控",
    "273": "仿冒公检法_回溯",
    "277": "色情诈骗",
    "279": "色情推广",
    "280": "私家侦探",
    "281": "低俗小说",
    "299": "欺诈投资理财",
    "300": "政府同步P2P平台",
    "302": "违规口罩销售",
    "303": "个人销售电子烟",
    "512": "挂马网站",
    "598": "漏洞网站",
    "600": "翻墙软件",
    "900": "侵权网站",
    "1111": "危险网址",
    "1112": "危险网址",
    "1113": "危险网址",
    "1114": "危险网址",
    "1115": "危险网址",
    "1540": "测试使用",
    "2048": "欺诈广告",
    "2100": "GPS欺诈",
    "2257": "虚假信息",
    "2258": "虚假信息",
    "2300": "虚假信息",
    "2302": "异常传播",
    "2303": "去结构化(聚类)",
    "2304": "去结构化",
    "2305": "骚扰传播",
    "2306": "mqq跳转传播",
    "2307": "低俗推广",
    "2308": "虚假信息",
    "2310": "微信诱导分享",
    "2400": "虚假信息",
    "2401": "虚假信息",
    "2402": "虚假信息",
    "2501": "色情支付APK",
    "2502": "仿冒公检法APK",
    "2503": "诱导分享APK",
    "2504": "赌博APK",
    "2505": "外挂APK",
    "2506": "贷款欺诈APP",
    "2507": "刷单欺诈APP",
    "2508": "理财欺诈APP",
    "2509": "赌博APK",
    "2510": "杀猪盘APP下载",
    "2511": "刷单APP下载",
    "2513": "贷款app下载",
    "2600": "仿冒品牌保护网站",
    "2700": "站点QQ发送异常",
    "2701": "王者充值",
    "2702": "王者礼包",
    "2703": "虚假信息",
    "2704": "虚假信息",
    "2705": "虚假信息",
    "2706": "虚假信息",
    "2707": "仿冒壳牌",
    "2708": "善心汇",
    "2709": "虚假信息",
    "2710": "空间诱导",
    "2711": "漏洞利用",
    "2712": "扫码诱导",
    "2713": "虚假信息",
    "2800": "异常传播",
    "2801": "QQ去rich",
    "2802": "未知去rich",
    "2803": "QQ丢弃",
    "2804": "账号提醒",
    "2805": "可疑分享中间页",
    "2806": "继续访问中间页",
    "2808": "账号提醒",
    "2809": "微信提醒",
    "2810": "非QQ官方网站",
    "2901": "医疗器械标识",
    "2902": "西安工商风险网站",
    "2903": "西安食药提醒备案",
    "2904": "西安食药提示风险",
    "3001": "发言侵权",
    "8192": "虚假商品",
    "8193": "二手车",
    "8194": "虚假手表",
    "8195": "虚假商品-壮阳",
    "8196": "虚假商品-稽查局",
    "8197": "虚假数码",
    "8198": "虚假贷款",
    "8199": "假信用卡",
    "8200": "假银行卡",
    "8201": "虚假股票证券交易",
    "8202": "特供商品",
    "8203": "非法虚拟币交易",
    "8204": "可疑虚拟币交易",
    "8205": "虚假商品交易平台",
    "8206": "可疑商品交易平台",
    "8207": "股票投资直播",
    "8208": "一元夺宝云购",
    "8209": "传销（新）",
    "8210": "可疑贷款",
    "8211": "可疑信用卡",
    "8212": "可疑投资理财",
    "8213": "虚假治疗药品",
    "8214": "虚假美容药品",
    "8215": "A货网址",
    "8216": "零元拍",
    "8220": "可疑返利信息",
    "8250": "虚假外汇交易",
    "8251": "可疑外汇交易",
    "8252": "虚假贵金属交易",
    "8253": "可疑贵金属交易",
    "8254": "虚假大宗商品交易",
    "8255": "可疑大宗商品交易",
    "8256": "虚假期货交易",
    "8257": "可疑期货交易",
    "8258": "外汇交易拦截",
    "8259": "淘宝诱导",
    "8260": "高风险小额贷款",
    "8261": "低风险小额贷款",
    "8262": "小额贷款信息发布平台",
    "8263": "基金投资平台",
    "8264": "股票咨询平台",
    "8265": "邮币卡交易",
    "8266": "高风险文化产权交易所",
    "8267": "低风险文化产权交易所",
    "8268": "杀毒软件威胁下载",
    "8269": "股票配资",
    "8270": "外汇信息交流",
    "8271": "杀毒软件威胁下载(调起震动)",
    "8272": "贷款口子",
    "8273": "赌博棋牌",
    "8274": "案情贷款诈骗",
    "8275": "案情刷单诈骗",
    "8276": "案情贷款诈骗",
    "8277": "可疑的客服链接",
    "8278": "仿冒的购物网站",
    "8300": "成人用品",
    "8301": "融资租赁",
    "8302": "供应链金融",
    "8303": "保理",
    "8304": "投资管理",
    "8305": "金融服务",
    "8306": "交易类返佣跟单平台",
    "8307": "交易类直播喊单平台",
    "8308": "金融配资",
    "8309": "期货平台",
    "8310": "其他投资",
    "8311": "可疑区块链",
    "8312": "加微信虚假广告",
    "8313": "仿冒微粒贷",
    "8314": "Safari崩溃",
    "8315": "色情诱导支付",
    "8316": "仿冒拼多多网站",
    "8317": "电影众筹",
    "8318": "理财通数字竞猜",
    "8319": "卡盟平台",
    "8320": "发卡平台",
    "8321": "(扫码渠道)仿冒欺诈网站",
    "8322": "ETC速通卡仿冒",
    "8323": "工商登记诈骗",
    "8324": "违规，欺诈网站",
    "16383": "非法博彩",
    "16384": "非法博彩",
    "16386": "博彩支付",
    "16387": "虚假彩票",
    "16388": "腾讯分分彩",
    "16389": "非法博彩(网信办)",
    "16390": "虚假彩票-有备案",
    "16391": "非法博彩-有备案",
    "16392": "彩票预测-有备案",
    "16393": "博彩诈骗",
    "16394": "高危博彩",
    "16395": "虚假链接",
    "16396": "博彩诈骗",
    "16397": "电竞赌博",
    "16398": "博彩诈骗",
    "16399": "非法博彩(网信办)",
    "16407": "非法欺诈（用户举报）",
    "16489": "非法博彩（用户举报）",
    "16501": "贷款诈骗APP中的链接",
    "16502": "理财诈骗app内部链接",
    "16503": "赌博app中的内部链接",
    "16505": "杀猪盘诈骗",
    "16506": "贷款诈骗",
    "16507": "刷单诈骗",
    "16508": "非法博彩",
    "16509": "涉政信息",
    "16510": "枪支信息",
    "16511": "黄毒网址",
    "16521": "投资诈骗",
    "16522": "",
    "16523": "",
    "16524": "赌博网站",
    "16525": "",
    "16526": "",
    "16527": "黄毒网站",
    "16555": "可疑信息",
    "20001": "法律追损",
    "20040": "赌博订单平台",
    "32768": "虚假火车票",
    "65536": "虚假视频",
    "65537": "虚假视频-沙箱",
    "65538": "诱导下载-管家",
    "100000": "公司代注册",
    "100001": "手机维修",
    "262144": "彩票预测信息",
    "524288": "病毒软件",
    "524289": "病毒软件-色播",
    "1001000": "欺诈大类-其他",
    "1048577": "非法外挂",
    "1048578": "木马外挂",
    "1048579": "非法私服",
    "1048580": "游戏代练",
    "2097152": "仿冒淘宝",
    "4194304": "仿冒腾讯游戏",
    "5001000": "赌博-其他",
    "5001101": "赌博-其他（浏览器）",
    "6001000": "色情-其他",
    "8388608": "虚假机票",
    "16777216": "金融传销",
    "16777300": "微交易微盘",
    "33554432": "仿冒网站",
    "33554433": "假发票验证平台",
    "67108864": "虚假药品",
    "67108866": "虚假商品",
    "268435456": "淘宝刷钻"
  }
     */
    public Long getEvilType() {
        return this.EvilType;
    }

    /**
     * Set [查询结果]url恶意类型:{
    "2": "盗号网站",
    "4": "中奖诈骗",
    "5": "虚假游戏币充值",
    "6": "非法政治",
    "7": "欺诈网站",
    "8": "刷Q币Q钻",
    "9": "欺诈类网站（总,不拦截）",
    "10": "欺诈-卡盟",
    "13": "非法商品",
    "14": "欺诈电话",
    "15": "贩卖枪支",
    "16": "话费欺诈",
    "17": "裸聊（拦截）",
    "18": "仿冒网站-银联举报",
    "19": "聊天室（不拦截）",
    "20": "成人游戏（不拦截）",
    "21": "一夜情交友(不拦截)",
    "22": "色情服务（不拦截）",
    "23": "微博拉黑",
    "24": "下载风险",
    "25": "病毒软件(apk)",
    "26": "病毒软件(apk不拦截)",
    "27": "病毒软件(apk低风险不拦截)",
    "28": "漏洞网站",
    "29": "色情网站-扫黄打非",
    "30": "可疑盗号（不拦截）",
    "31": "仿冒京东",
    "32": "仿冒银行",
    "33": "仿冒运营商",
    "34": "扫黄打非",
    "35": "仿冒苹果",
    "36": "CNCERT-木马",
    "37": "CNCERT-移动病毒",
    "38": "CNCERT-钓鱼",
    "39": "在线赌博",
    "40": "赌博游戏",
    "41": "秒赞",
    "42": "虚假商品",
    "43": "仿冒腾讯网",
    "44": "游戏账号交易",
    "45": "二手交易诈骗",
    "46": "充值平台-卡盟",
    "47": "虚假兼职",
    "48": "公司业务充值",
    "49": "赌博投注",
    "50": "侵权网站",
    "51": "兼职招聘后台",
    "52": "虚假支付",
    "53": "虚假兼职",
    "54": "虚假视频",
    "55": "虚假小说",
    "56": "非法图片",
    "57": "成人用品",
    "58": "虚假兼职bbs",
    "59": "虚假兼职流程",
    "60": "仿冒政府",
    "62": "虚假广告",
    "63": "恶意跳转",
    "64": "盗版腾讯视频",
    "65": "NBA直播盗版",
    "66": "测试",
    "68": "空间欺诈",
    "70": "清粉",
    "76": "含有apk的恶意url",
    "77": "拦截马",
    "78": "黑产",
    "79": "虚假投资理财",
    "80": "侵权网站",
    "81": "仿冒公检法",
    "82": "诱导传播-U镜",
    "83": "仿冒微信",
    "84": "买卖微信账号",
    "88": "欺诈网站(品牌保护专用)",
    "91": "非法政治(领导人)",
    "92": "非法政治（六四）",
    "93": "非法政治（法轮功）",
    "94": "非法政治（攻击政党）",
    "95": "非法政治（暴恐）",
    "96": "非法政治（其他）",
    "100": "信安博彩",
    "101": "信安色情",
    "102": "信安事件",
    "103": "信安暴力",
    "104": "信安违法",
    "105": "信安欺诈",
    "106": "信安版权",
    "107": "信安谣言",
    "108": "信安欺诈总",
    "109": "游戏租号",
    "110": "恶意挖矿",
    "120": "虚假广告推广",
    "128": "欺诈网站（网信办）",
    "222": "高考诈骗",
    "248": "非法色情",
    "250": "游戏盗号",
    "251": "游戏推广",
    "252": "股票推荐",
    "253": "工作流程",
    "254": "兼职申请表",
    "255": "tag检测色情",
    "256": "非法色情（cache已淘汰）",
    "257": "非法色情-搜索",
    "258": "非法色情（强类型）",
    "259": "非法色情（支付）",
    "260": "非法色情（支付）",
    "261": "诱导支付（红包）",
    "262": "儿童色情网站",
    "263": "加群支付",
    "264": "支付后台",
    "265": "本命佛",
    "266": "二维码软文",
    "267": "机器学习虚假博彩",
    "268": "色情网站(网信办)",
    "269": "机器学习虚假色情",
    "270": "虚假支付",
    "271": "佛法",
    "272": "仿冒公检法_监控",
    "273": "仿冒公检法_回溯",
    "277": "色情诈骗",
    "279": "色情推广",
    "280": "私家侦探",
    "281": "低俗小说",
    "299": "欺诈投资理财",
    "300": "政府同步P2P平台",
    "302": "违规口罩销售",
    "303": "个人销售电子烟",
    "512": "挂马网站",
    "598": "漏洞网站",
    "600": "翻墙软件",
    "900": "侵权网站",
    "1111": "危险网址",
    "1112": "危险网址",
    "1113": "危险网址",
    "1114": "危险网址",
    "1115": "危险网址",
    "1540": "测试使用",
    "2048": "欺诈广告",
    "2100": "GPS欺诈",
    "2257": "虚假信息",
    "2258": "虚假信息",
    "2300": "虚假信息",
    "2302": "异常传播",
    "2303": "去结构化(聚类)",
    "2304": "去结构化",
    "2305": "骚扰传播",
    "2306": "mqq跳转传播",
    "2307": "低俗推广",
    "2308": "虚假信息",
    "2310": "微信诱导分享",
    "2400": "虚假信息",
    "2401": "虚假信息",
    "2402": "虚假信息",
    "2501": "色情支付APK",
    "2502": "仿冒公检法APK",
    "2503": "诱导分享APK",
    "2504": "赌博APK",
    "2505": "外挂APK",
    "2506": "贷款欺诈APP",
    "2507": "刷单欺诈APP",
    "2508": "理财欺诈APP",
    "2509": "赌博APK",
    "2510": "杀猪盘APP下载",
    "2511": "刷单APP下载",
    "2513": "贷款app下载",
    "2600": "仿冒品牌保护网站",
    "2700": "站点QQ发送异常",
    "2701": "王者充值",
    "2702": "王者礼包",
    "2703": "虚假信息",
    "2704": "虚假信息",
    "2705": "虚假信息",
    "2706": "虚假信息",
    "2707": "仿冒壳牌",
    "2708": "善心汇",
    "2709": "虚假信息",
    "2710": "空间诱导",
    "2711": "漏洞利用",
    "2712": "扫码诱导",
    "2713": "虚假信息",
    "2800": "异常传播",
    "2801": "QQ去rich",
    "2802": "未知去rich",
    "2803": "QQ丢弃",
    "2804": "账号提醒",
    "2805": "可疑分享中间页",
    "2806": "继续访问中间页",
    "2808": "账号提醒",
    "2809": "微信提醒",
    "2810": "非QQ官方网站",
    "2901": "医疗器械标识",
    "2902": "西安工商风险网站",
    "2903": "西安食药提醒备案",
    "2904": "西安食药提示风险",
    "3001": "发言侵权",
    "8192": "虚假商品",
    "8193": "二手车",
    "8194": "虚假手表",
    "8195": "虚假商品-壮阳",
    "8196": "虚假商品-稽查局",
    "8197": "虚假数码",
    "8198": "虚假贷款",
    "8199": "假信用卡",
    "8200": "假银行卡",
    "8201": "虚假股票证券交易",
    "8202": "特供商品",
    "8203": "非法虚拟币交易",
    "8204": "可疑虚拟币交易",
    "8205": "虚假商品交易平台",
    "8206": "可疑商品交易平台",
    "8207": "股票投资直播",
    "8208": "一元夺宝云购",
    "8209": "传销（新）",
    "8210": "可疑贷款",
    "8211": "可疑信用卡",
    "8212": "可疑投资理财",
    "8213": "虚假治疗药品",
    "8214": "虚假美容药品",
    "8215": "A货网址",
    "8216": "零元拍",
    "8220": "可疑返利信息",
    "8250": "虚假外汇交易",
    "8251": "可疑外汇交易",
    "8252": "虚假贵金属交易",
    "8253": "可疑贵金属交易",
    "8254": "虚假大宗商品交易",
    "8255": "可疑大宗商品交易",
    "8256": "虚假期货交易",
    "8257": "可疑期货交易",
    "8258": "外汇交易拦截",
    "8259": "淘宝诱导",
    "8260": "高风险小额贷款",
    "8261": "低风险小额贷款",
    "8262": "小额贷款信息发布平台",
    "8263": "基金投资平台",
    "8264": "股票咨询平台",
    "8265": "邮币卡交易",
    "8266": "高风险文化产权交易所",
    "8267": "低风险文化产权交易所",
    "8268": "杀毒软件威胁下载",
    "8269": "股票配资",
    "8270": "外汇信息交流",
    "8271": "杀毒软件威胁下载(调起震动)",
    "8272": "贷款口子",
    "8273": "赌博棋牌",
    "8274": "案情贷款诈骗",
    "8275": "案情刷单诈骗",
    "8276": "案情贷款诈骗",
    "8277": "可疑的客服链接",
    "8278": "仿冒的购物网站",
    "8300": "成人用品",
    "8301": "融资租赁",
    "8302": "供应链金融",
    "8303": "保理",
    "8304": "投资管理",
    "8305": "金融服务",
    "8306": "交易类返佣跟单平台",
    "8307": "交易类直播喊单平台",
    "8308": "金融配资",
    "8309": "期货平台",
    "8310": "其他投资",
    "8311": "可疑区块链",
    "8312": "加微信虚假广告",
    "8313": "仿冒微粒贷",
    "8314": "Safari崩溃",
    "8315": "色情诱导支付",
    "8316": "仿冒拼多多网站",
    "8317": "电影众筹",
    "8318": "理财通数字竞猜",
    "8319": "卡盟平台",
    "8320": "发卡平台",
    "8321": "(扫码渠道)仿冒欺诈网站",
    "8322": "ETC速通卡仿冒",
    "8323": "工商登记诈骗",
    "8324": "违规，欺诈网站",
    "16383": "非法博彩",
    "16384": "非法博彩",
    "16386": "博彩支付",
    "16387": "虚假彩票",
    "16388": "腾讯分分彩",
    "16389": "非法博彩(网信办)",
    "16390": "虚假彩票-有备案",
    "16391": "非法博彩-有备案",
    "16392": "彩票预测-有备案",
    "16393": "博彩诈骗",
    "16394": "高危博彩",
    "16395": "虚假链接",
    "16396": "博彩诈骗",
    "16397": "电竞赌博",
    "16398": "博彩诈骗",
    "16399": "非法博彩(网信办)",
    "16407": "非法欺诈（用户举报）",
    "16489": "非法博彩（用户举报）",
    "16501": "贷款诈骗APP中的链接",
    "16502": "理财诈骗app内部链接",
    "16503": "赌博app中的内部链接",
    "16505": "杀猪盘诈骗",
    "16506": "贷款诈骗",
    "16507": "刷单诈骗",
    "16508": "非法博彩",
    "16509": "涉政信息",
    "16510": "枪支信息",
    "16511": "黄毒网址",
    "16521": "投资诈骗",
    "16522": "",
    "16523": "",
    "16524": "赌博网站",
    "16525": "",
    "16526": "",
    "16527": "黄毒网站",
    "16555": "可疑信息",
    "20001": "法律追损",
    "20040": "赌博订单平台",
    "32768": "虚假火车票",
    "65536": "虚假视频",
    "65537": "虚假视频-沙箱",
    "65538": "诱导下载-管家",
    "100000": "公司代注册",
    "100001": "手机维修",
    "262144": "彩票预测信息",
    "524288": "病毒软件",
    "524289": "病毒软件-色播",
    "1001000": "欺诈大类-其他",
    "1048577": "非法外挂",
    "1048578": "木马外挂",
    "1048579": "非法私服",
    "1048580": "游戏代练",
    "2097152": "仿冒淘宝",
    "4194304": "仿冒腾讯游戏",
    "5001000": "赌博-其他",
    "5001101": "赌博-其他（浏览器）",
    "6001000": "色情-其他",
    "8388608": "虚假机票",
    "16777216": "金融传销",
    "16777300": "微交易微盘",
    "33554432": "仿冒网站",
    "33554433": "假发票验证平台",
    "67108864": "虚假药品",
    "67108866": "虚假商品",
    "268435456": "淘宝刷钻"
  }
     * @param EvilType [查询结果]url恶意类型:{
    "2": "盗号网站",
    "4": "中奖诈骗",
    "5": "虚假游戏币充值",
    "6": "非法政治",
    "7": "欺诈网站",
    "8": "刷Q币Q钻",
    "9": "欺诈类网站（总,不拦截）",
    "10": "欺诈-卡盟",
    "13": "非法商品",
    "14": "欺诈电话",
    "15": "贩卖枪支",
    "16": "话费欺诈",
    "17": "裸聊（拦截）",
    "18": "仿冒网站-银联举报",
    "19": "聊天室（不拦截）",
    "20": "成人游戏（不拦截）",
    "21": "一夜情交友(不拦截)",
    "22": "色情服务（不拦截）",
    "23": "微博拉黑",
    "24": "下载风险",
    "25": "病毒软件(apk)",
    "26": "病毒软件(apk不拦截)",
    "27": "病毒软件(apk低风险不拦截)",
    "28": "漏洞网站",
    "29": "色情网站-扫黄打非",
    "30": "可疑盗号（不拦截）",
    "31": "仿冒京东",
    "32": "仿冒银行",
    "33": "仿冒运营商",
    "34": "扫黄打非",
    "35": "仿冒苹果",
    "36": "CNCERT-木马",
    "37": "CNCERT-移动病毒",
    "38": "CNCERT-钓鱼",
    "39": "在线赌博",
    "40": "赌博游戏",
    "41": "秒赞",
    "42": "虚假商品",
    "43": "仿冒腾讯网",
    "44": "游戏账号交易",
    "45": "二手交易诈骗",
    "46": "充值平台-卡盟",
    "47": "虚假兼职",
    "48": "公司业务充值",
    "49": "赌博投注",
    "50": "侵权网站",
    "51": "兼职招聘后台",
    "52": "虚假支付",
    "53": "虚假兼职",
    "54": "虚假视频",
    "55": "虚假小说",
    "56": "非法图片",
    "57": "成人用品",
    "58": "虚假兼职bbs",
    "59": "虚假兼职流程",
    "60": "仿冒政府",
    "62": "虚假广告",
    "63": "恶意跳转",
    "64": "盗版腾讯视频",
    "65": "NBA直播盗版",
    "66": "测试",
    "68": "空间欺诈",
    "70": "清粉",
    "76": "含有apk的恶意url",
    "77": "拦截马",
    "78": "黑产",
    "79": "虚假投资理财",
    "80": "侵权网站",
    "81": "仿冒公检法",
    "82": "诱导传播-U镜",
    "83": "仿冒微信",
    "84": "买卖微信账号",
    "88": "欺诈网站(品牌保护专用)",
    "91": "非法政治(领导人)",
    "92": "非法政治（六四）",
    "93": "非法政治（法轮功）",
    "94": "非法政治（攻击政党）",
    "95": "非法政治（暴恐）",
    "96": "非法政治（其他）",
    "100": "信安博彩",
    "101": "信安色情",
    "102": "信安事件",
    "103": "信安暴力",
    "104": "信安违法",
    "105": "信安欺诈",
    "106": "信安版权",
    "107": "信安谣言",
    "108": "信安欺诈总",
    "109": "游戏租号",
    "110": "恶意挖矿",
    "120": "虚假广告推广",
    "128": "欺诈网站（网信办）",
    "222": "高考诈骗",
    "248": "非法色情",
    "250": "游戏盗号",
    "251": "游戏推广",
    "252": "股票推荐",
    "253": "工作流程",
    "254": "兼职申请表",
    "255": "tag检测色情",
    "256": "非法色情（cache已淘汰）",
    "257": "非法色情-搜索",
    "258": "非法色情（强类型）",
    "259": "非法色情（支付）",
    "260": "非法色情（支付）",
    "261": "诱导支付（红包）",
    "262": "儿童色情网站",
    "263": "加群支付",
    "264": "支付后台",
    "265": "本命佛",
    "266": "二维码软文",
    "267": "机器学习虚假博彩",
    "268": "色情网站(网信办)",
    "269": "机器学习虚假色情",
    "270": "虚假支付",
    "271": "佛法",
    "272": "仿冒公检法_监控",
    "273": "仿冒公检法_回溯",
    "277": "色情诈骗",
    "279": "色情推广",
    "280": "私家侦探",
    "281": "低俗小说",
    "299": "欺诈投资理财",
    "300": "政府同步P2P平台",
    "302": "违规口罩销售",
    "303": "个人销售电子烟",
    "512": "挂马网站",
    "598": "漏洞网站",
    "600": "翻墙软件",
    "900": "侵权网站",
    "1111": "危险网址",
    "1112": "危险网址",
    "1113": "危险网址",
    "1114": "危险网址",
    "1115": "危险网址",
    "1540": "测试使用",
    "2048": "欺诈广告",
    "2100": "GPS欺诈",
    "2257": "虚假信息",
    "2258": "虚假信息",
    "2300": "虚假信息",
    "2302": "异常传播",
    "2303": "去结构化(聚类)",
    "2304": "去结构化",
    "2305": "骚扰传播",
    "2306": "mqq跳转传播",
    "2307": "低俗推广",
    "2308": "虚假信息",
    "2310": "微信诱导分享",
    "2400": "虚假信息",
    "2401": "虚假信息",
    "2402": "虚假信息",
    "2501": "色情支付APK",
    "2502": "仿冒公检法APK",
    "2503": "诱导分享APK",
    "2504": "赌博APK",
    "2505": "外挂APK",
    "2506": "贷款欺诈APP",
    "2507": "刷单欺诈APP",
    "2508": "理财欺诈APP",
    "2509": "赌博APK",
    "2510": "杀猪盘APP下载",
    "2511": "刷单APP下载",
    "2513": "贷款app下载",
    "2600": "仿冒品牌保护网站",
    "2700": "站点QQ发送异常",
    "2701": "王者充值",
    "2702": "王者礼包",
    "2703": "虚假信息",
    "2704": "虚假信息",
    "2705": "虚假信息",
    "2706": "虚假信息",
    "2707": "仿冒壳牌",
    "2708": "善心汇",
    "2709": "虚假信息",
    "2710": "空间诱导",
    "2711": "漏洞利用",
    "2712": "扫码诱导",
    "2713": "虚假信息",
    "2800": "异常传播",
    "2801": "QQ去rich",
    "2802": "未知去rich",
    "2803": "QQ丢弃",
    "2804": "账号提醒",
    "2805": "可疑分享中间页",
    "2806": "继续访问中间页",
    "2808": "账号提醒",
    "2809": "微信提醒",
    "2810": "非QQ官方网站",
    "2901": "医疗器械标识",
    "2902": "西安工商风险网站",
    "2903": "西安食药提醒备案",
    "2904": "西安食药提示风险",
    "3001": "发言侵权",
    "8192": "虚假商品",
    "8193": "二手车",
    "8194": "虚假手表",
    "8195": "虚假商品-壮阳",
    "8196": "虚假商品-稽查局",
    "8197": "虚假数码",
    "8198": "虚假贷款",
    "8199": "假信用卡",
    "8200": "假银行卡",
    "8201": "虚假股票证券交易",
    "8202": "特供商品",
    "8203": "非法虚拟币交易",
    "8204": "可疑虚拟币交易",
    "8205": "虚假商品交易平台",
    "8206": "可疑商品交易平台",
    "8207": "股票投资直播",
    "8208": "一元夺宝云购",
    "8209": "传销（新）",
    "8210": "可疑贷款",
    "8211": "可疑信用卡",
    "8212": "可疑投资理财",
    "8213": "虚假治疗药品",
    "8214": "虚假美容药品",
    "8215": "A货网址",
    "8216": "零元拍",
    "8220": "可疑返利信息",
    "8250": "虚假外汇交易",
    "8251": "可疑外汇交易",
    "8252": "虚假贵金属交易",
    "8253": "可疑贵金属交易",
    "8254": "虚假大宗商品交易",
    "8255": "可疑大宗商品交易",
    "8256": "虚假期货交易",
    "8257": "可疑期货交易",
    "8258": "外汇交易拦截",
    "8259": "淘宝诱导",
    "8260": "高风险小额贷款",
    "8261": "低风险小额贷款",
    "8262": "小额贷款信息发布平台",
    "8263": "基金投资平台",
    "8264": "股票咨询平台",
    "8265": "邮币卡交易",
    "8266": "高风险文化产权交易所",
    "8267": "低风险文化产权交易所",
    "8268": "杀毒软件威胁下载",
    "8269": "股票配资",
    "8270": "外汇信息交流",
    "8271": "杀毒软件威胁下载(调起震动)",
    "8272": "贷款口子",
    "8273": "赌博棋牌",
    "8274": "案情贷款诈骗",
    "8275": "案情刷单诈骗",
    "8276": "案情贷款诈骗",
    "8277": "可疑的客服链接",
    "8278": "仿冒的购物网站",
    "8300": "成人用品",
    "8301": "融资租赁",
    "8302": "供应链金融",
    "8303": "保理",
    "8304": "投资管理",
    "8305": "金融服务",
    "8306": "交易类返佣跟单平台",
    "8307": "交易类直播喊单平台",
    "8308": "金融配资",
    "8309": "期货平台",
    "8310": "其他投资",
    "8311": "可疑区块链",
    "8312": "加微信虚假广告",
    "8313": "仿冒微粒贷",
    "8314": "Safari崩溃",
    "8315": "色情诱导支付",
    "8316": "仿冒拼多多网站",
    "8317": "电影众筹",
    "8318": "理财通数字竞猜",
    "8319": "卡盟平台",
    "8320": "发卡平台",
    "8321": "(扫码渠道)仿冒欺诈网站",
    "8322": "ETC速通卡仿冒",
    "8323": "工商登记诈骗",
    "8324": "违规，欺诈网站",
    "16383": "非法博彩",
    "16384": "非法博彩",
    "16386": "博彩支付",
    "16387": "虚假彩票",
    "16388": "腾讯分分彩",
    "16389": "非法博彩(网信办)",
    "16390": "虚假彩票-有备案",
    "16391": "非法博彩-有备案",
    "16392": "彩票预测-有备案",
    "16393": "博彩诈骗",
    "16394": "高危博彩",
    "16395": "虚假链接",
    "16396": "博彩诈骗",
    "16397": "电竞赌博",
    "16398": "博彩诈骗",
    "16399": "非法博彩(网信办)",
    "16407": "非法欺诈（用户举报）",
    "16489": "非法博彩（用户举报）",
    "16501": "贷款诈骗APP中的链接",
    "16502": "理财诈骗app内部链接",
    "16503": "赌博app中的内部链接",
    "16505": "杀猪盘诈骗",
    "16506": "贷款诈骗",
    "16507": "刷单诈骗",
    "16508": "非法博彩",
    "16509": "涉政信息",
    "16510": "枪支信息",
    "16511": "黄毒网址",
    "16521": "投资诈骗",
    "16522": "",
    "16523": "",
    "16524": "赌博网站",
    "16525": "",
    "16526": "",
    "16527": "黄毒网站",
    "16555": "可疑信息",
    "20001": "法律追损",
    "20040": "赌博订单平台",
    "32768": "虚假火车票",
    "65536": "虚假视频",
    "65537": "虚假视频-沙箱",
    "65538": "诱导下载-管家",
    "100000": "公司代注册",
    "100001": "手机维修",
    "262144": "彩票预测信息",
    "524288": "病毒软件",
    "524289": "病毒软件-色播",
    "1001000": "欺诈大类-其他",
    "1048577": "非法外挂",
    "1048578": "木马外挂",
    "1048579": "非法私服",
    "1048580": "游戏代练",
    "2097152": "仿冒淘宝",
    "4194304": "仿冒腾讯游戏",
    "5001000": "赌博-其他",
    "5001101": "赌博-其他（浏览器）",
    "6001000": "色情-其他",
    "8388608": "虚假机票",
    "16777216": "金融传销",
    "16777300": "微交易微盘",
    "33554432": "仿冒网站",
    "33554433": "假发票验证平台",
    "67108864": "虚假药品",
    "67108866": "虚假商品",
    "268435456": "淘宝刷钻"
  }
     */
    public void setEvilType(Long EvilType) {
        this.EvilType = EvilType;
    }

    /**
     * Get [查询结果]url恶意级别:{
    "1": "链接",
    "2": "Cgi",
    "3": "路径",
    "4": "整站",
    "5": "整域"
} 
     * @return Level [查询结果]url恶意级别:{
    "1": "链接",
    "2": "Cgi",
    "3": "路径",
    "4": "整站",
    "5": "整域"
}
     */
    public Long getLevel() {
        return this.Level;
    }

    /**
     * Set [查询结果]url恶意级别:{
    "1": "链接",
    "2": "Cgi",
    "3": "路径",
    "4": "整站",
    "5": "整域"
}
     * @param Level [查询结果]url恶意级别:{
    "1": "链接",
    "2": "Cgi",
    "3": "路径",
    "4": "整站",
    "5": "整域"
}
     */
    public void setLevel(Long Level) {
        this.Level = Level;
    }

    /**
     * Get [查询详情]url检出时间 
     * @return DetectTime [查询详情]url检出时间
     */
    public Long getDetectTime() {
        return this.DetectTime;
    }

    /**
     * Set [查询详情]url检出时间
     * @param DetectTime [查询详情]url检出时间
     */
    public void setDetectTime(Long DetectTime) {
        this.DetectTime = DetectTime;
    }

    /**
     * Get [查询详情]拦截Wording 
     * @return Wording [查询详情]拦截Wording
     */
    public String getWording() {
        return this.Wording;
    }

    /**
     * Set [查询详情]拦截Wording
     * @param Wording [查询详情]拦截Wording
     */
    public void setWording(String Wording) {
        this.Wording = Wording;
    }

    /**
     * Get [查询详情]拦截Wording 标题 
     * @return WordingTitle [查询详情]拦截Wording 标题
     */
    public String getWordingTitle() {
        return this.WordingTitle;
    }

    /**
     * Set [查询详情]拦截Wording 标题
     * @param WordingTitle [查询详情]拦截Wording 标题
     */
    public void setWordingTitle(String WordingTitle) {
        this.WordingTitle = WordingTitle;
    }

    /**
     * Get [查询结果]url恶意状态说明；为UrlType字段值对应的说明 
     * @return UrlTypeDesc [查询结果]url恶意状态说明；为UrlType字段值对应的说明
     */
    public String getUrlTypeDesc() {
        return this.UrlTypeDesc;
    }

    /**
     * Set [查询结果]url恶意状态说明；为UrlType字段值对应的说明
     * @param UrlTypeDesc [查询结果]url恶意状态说明；为UrlType字段值对应的说明
     */
    public void setUrlTypeDesc(String UrlTypeDesc) {
        this.UrlTypeDesc = UrlTypeDesc;
    }

    /**
     * Get [查询结果]url恶意大类说明；为EvilClass字段值对应的说明 
     * @return EvilClassDesc [查询结果]url恶意大类说明；为EvilClass字段值对应的说明
     */
    public String getEvilClassDesc() {
        return this.EvilClassDesc;
    }

    /**
     * Set [查询结果]url恶意大类说明；为EvilClass字段值对应的说明
     * @param EvilClassDesc [查询结果]url恶意大类说明；为EvilClass字段值对应的说明
     */
    public void setEvilClassDesc(String EvilClassDesc) {
        this.EvilClassDesc = EvilClassDesc;
    }

    /**
     * Get [查询结果]url恶意类型说明；为EvilType字段值对应的说明 
     * @return EvilTypeDesc [查询结果]url恶意类型说明；为EvilType字段值对应的说明
     */
    public String getEvilTypeDesc() {
        return this.EvilTypeDesc;
    }

    /**
     * Set [查询结果]url恶意类型说明；为EvilType字段值对应的说明
     * @param EvilTypeDesc [查询结果]url恶意类型说明；为EvilType字段值对应的说明
     */
    public void setEvilTypeDesc(String EvilTypeDesc) {
        this.EvilTypeDesc = EvilTypeDesc;
    }

    /**
     * Get [查询结果]url恶意级别说明；为Level字段值对应的说明 
     * @return LevelDesc [查询结果]url恶意级别说明；为Level字段值对应的说明
     */
    public String getLevelDesc() {
        return this.LevelDesc;
    }

    /**
     * Set [查询结果]url恶意级别说明；为Level字段值对应的说明
     * @param LevelDesc [查询结果]url恶意级别说明；为Level字段值对应的说明
     */
    public void setLevelDesc(String LevelDesc) {
        this.LevelDesc = LevelDesc;
    }

    /**
     * Get 唯一请求 ID，每次请求都会返回。定位问题时需要提供该次请求的 RequestId。 
     * @return RequestId 唯一请求 ID，每次请求都会返回。定位问题时需要提供该次请求的 RequestId。
     */
    public String getRequestId() {
        return this.RequestId;
    }

    /**
     * Set 唯一请求 ID，每次请求都会返回。定位问题时需要提供该次请求的 RequestId。
     * @param RequestId 唯一请求 ID，每次请求都会返回。定位问题时需要提供该次请求的 RequestId。
     */
    public void setRequestId(String RequestId) {
        this.RequestId = RequestId;
    }

    public DescribeUrlDetectionResultResponse() {
    }

    /**
     * NOTE: Any ambiguous key set via .set("AnyKey", "value") will be a shallow copy,
     *       and any explicit key, i.e Foo, set via .setFoo("value") will be a deep copy.
     */
    public DescribeUrlDetectionResultResponse(DescribeUrlDetectionResultResponse source) {
        if (source.ResultCode != null) {
            this.ResultCode = new Long(source.ResultCode);
        }
        if (source.RespVer != null) {
            this.RespVer = new Long(source.RespVer);
        }
        if (source.UrlType != null) {
            this.UrlType = new Long(source.UrlType);
        }
        if (source.EvilClass != null) {
            this.EvilClass = new Long(source.EvilClass);
        }
        if (source.EvilType != null) {
            this.EvilType = new Long(source.EvilType);
        }
        if (source.Level != null) {
            this.Level = new Long(source.Level);
        }
        if (source.DetectTime != null) {
            this.DetectTime = new Long(source.DetectTime);
        }
        if (source.Wording != null) {
            this.Wording = new String(source.Wording);
        }
        if (source.WordingTitle != null) {
            this.WordingTitle = new String(source.WordingTitle);
        }
        if (source.UrlTypeDesc != null) {
            this.UrlTypeDesc = new String(source.UrlTypeDesc);
        }
        if (source.EvilClassDesc != null) {
            this.EvilClassDesc = new String(source.EvilClassDesc);
        }
        if (source.EvilTypeDesc != null) {
            this.EvilTypeDesc = new String(source.EvilTypeDesc);
        }
        if (source.LevelDesc != null) {
            this.LevelDesc = new String(source.LevelDesc);
        }
        if (source.RequestId != null) {
            this.RequestId = new String(source.RequestId);
        }
    }


    /**
     * Internal implementation, normal users should not use it.
     */
    public void toMap(HashMap<String, String> map, String prefix) {
        this.setParamSimple(map, prefix + "ResultCode", this.ResultCode);
        this.setParamSimple(map, prefix + "RespVer", this.RespVer);
        this.setParamSimple(map, prefix + "UrlType", this.UrlType);
        this.setParamSimple(map, prefix + "EvilClass", this.EvilClass);
        this.setParamSimple(map, prefix + "EvilType", this.EvilType);
        this.setParamSimple(map, prefix + "Level", this.Level);
        this.setParamSimple(map, prefix + "DetectTime", this.DetectTime);
        this.setParamSimple(map, prefix + "Wording", this.Wording);
        this.setParamSimple(map, prefix + "WordingTitle", this.WordingTitle);
        this.setParamSimple(map, prefix + "UrlTypeDesc", this.UrlTypeDesc);
        this.setParamSimple(map, prefix + "EvilClassDesc", this.EvilClassDesc);
        this.setParamSimple(map, prefix + "EvilTypeDesc", this.EvilTypeDesc);
        this.setParamSimple(map, prefix + "LevelDesc", this.LevelDesc);
        this.setParamSimple(map, prefix + "RequestId", this.RequestId);

    }
}

